In [1]:
import numpy as np 
import pandas as pd

In [3]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [8]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working with Dates

In [9]:
# Converting to dataframe datatype
date['date'] = pd.to_datetime(date['date'])

In [10]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

1. Extract Year

In [12]:
date['date_year'] = date['date'].dt.year

date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

 2. Extract Month

In [13]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

        date  product_id  city_id  orders  date_year date_month_name
0 2019-12-10        5628       25       3       2019        December
1 2018-08-15        3646       14     157       2018          August
2 2018-10-23        1859       25       1       2018         October
3 2019-08-17        7292       25       1       2019          August
4 2019-01-06        4344       25       3       2019         January

In [15]:
date['date_month_no'] = date['date'].dt.month

date.head()

,date,product_id,city_id,orders,date_year,date_month_name,date_month_no
0,2019-12-10,5628,25,3,2019,December,12
1,2018-08-15,3646,14,157,2018,August,8
2,2018-10-23,1859,25,1,2018,October,10
3,2019-08-17,7292,25,1,2019,August,8
4,2019-01-06,4344,25,3,2019,January,1

3. Extract Days

In [16]:
date['date_day'] = date['date'].dt.day

date.head()

,date,product_id,city_id,orders,date_year,date_month_name,date_month_no,date_day
0,2019-12-10,5628,25,3,2019,December,12,10
1,2018-08-15,3646,14,157,2018,August,8,15
2,2018-10-23,1859,25,1,2018,October,10,23
3,2019-08-17,7292,25,1,2019,August,8,17
4,2019-01-06,4344,25,3,2019,January,1,6

In [17]:
# day of week 
date['date_dow'] = date['date'].dt.dayofweek

date.head()

,date,product_id,city_id,orders,date_year,date_month_name,date_month_no,date_day,date_dow
0,2019-12-10,5628,25,3,2019,December,12,10,1
1,2018-08-15,3646,14,157,2018,August,8,15,2
2,2018-10-23,1859,25,1,2018,October,10,23,1
3,2019-08-17,7292,25,1,2019,August,8,17,5
4,2019-01-06,4344,25,3,2019,January,1,6,6

In [18]:
# day of week - name 

date['date_dow_name'] = date['date'].dt.day_name()

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_name,date_month_no,date_day,date_dow,date_dow_name
0,2019-12-10,2019,December,12,10,1,Tuesday
1,2018-08-15,2018,August,8,15,2,Wednesday
2,2018-10-23,2018,October,10,23,1,Tuesday
3,2019-08-17,2019,August,8,17,5,Saturday
4,2019-01-06,2019,January,1,6,6,Sunday

In [19]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_name,date_month_no,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,December,12,10,1,Tuesday,0
1,2018-08-15,2018,August,8,15,2,Wednesday,0
2,2018-10-23,2018,October,10,23,1,Tuesday,0
3,2019-08-17,2019,August,8,17,5,Saturday,1
4,2019-01-06,2019,January,1,6,6,Sunday,1

4. Extract week of the year

In [23]:
date['date_week'] = date['date'].dt.isocalendar().week

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_name,date_month_no,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,December,12,10,1,Tuesday,0,50
1,2018-08-15,2018,August,8,15,2,Wednesday,0,33
2,2018-10-23,2018,October,10,23,1,Tuesday,0,43
3,2019-08-17,2019,August,8,17,5,Saturday,1,33
4,2019-01-06,2019,January,1,6,6,Sunday,1,1

5. Extract quarter

In [24]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_name,date_month_no,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,December,12,10,1,Tuesday,0,50,4
1,2018-08-15,2018,August,8,15,2,Wednesday,0,33,3
2,2018-10-23,2018,October,10,23,1,Tuesday,0,43,4
3,2019-08-17,2019,August,8,17,5,Saturday,1,33,3
4,2019-01-06,2019,January,1,6,6,Sunday,1,1,1

In [27]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_name,date_month_no,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,December,12,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,August,8,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,October,10,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,August,8,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,January,1,6,6,Sunday,1,1,1,1

6. Extract Time elapsed between dates

In [28]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 6, 30, 17, 52, 48, 124358)

In [30]:
today - date['date']

0     2029 days 17:53:27.003238
1     2511 days 17:53:27.003238
2     2442 days 17:53:27.003238
3     2144 days 17:53:27.003238
4     2367 days 17:53:27.003238
                 ...
995   2457 days 17:53:27.003238
996   2398 days 17:53:27.003238
997   2246 days 17:53:27.003238
998   2311 days 17:53:27.003238
999   2085 days 17:53:27.003238
Name: date, Length: 1000, dtype: timedelta64[ns]

In [31]:
(today - date['date']).dt.days

0      2029
1      2511
2      2442
3      2144
4      2367
       ...
995    2457
996    2398
997    2246
998    2311
999    2085
Name: date, Length: 1000, dtype: int64

In [33]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'm'),0)

0      2922833.0
1      3616913.0
2      3517553.0
3      3088433.0
4      3409553.0
         ...
995    3539153.0
996    3454193.0
997    3235313.0
998    3328913.0
999    3003473.0
Name: date, Length: 1000, dtype: float64

In [34]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [36]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [38]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [39]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [40]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

7. Extract time part

In [41]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

8. Time difference

In [42]:
today - time['date']

0     4215 days 17:03:27.003238
1     4079 days 18:13:27.003238
2     4565 days 17:32:27.003238
3     3867 days 17:22:27.003238
4     4264 days 18:42:27.003238
                 ...
995   4854 days 17:03:27.003238
996   4175 days 18:39:27.003238
997   4640 days 18:16:27.003238
998   4756 days 18:19:27.003238
999   4028 days 18:28:27.003238
Name: date, Length: 1000, dtype: timedelta64[ns]

In [43]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.642374e+08
1      3.524912e+08
2      3.944791e+08
3      3.341713e+08
4      3.684769e+08
           ...
995    4.194470e+08
996    3.607872e+08
997    4.009618e+08
998    4.109844e+08
999    3.480857e+08
Name: date, Length: 1000, dtype: float64

In [44]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.070623e+06
1      5.874853e+06
2      6.574652e+06
3      5.569522e+06
4      6.141282e+06
           ...
995    6.990783e+06
996    6.013119e+06
997    6.682696e+06
998    6.849739e+06
999    5.801428e+06
Name: date, Length: 1000, dtype: float64

In [45]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      101177.057501
1       97914.224168
2      109577.540834
3       92825.374168
4      102354.707501
           ...
995    116513.057501
996    100218.657501
997    111378.274168
998    114162.324168
999     96690.474168
Name: date, Length: 1000, dtype: float64